In [2]:
import pandas as pd

In [2]:
y=pd.Period('2016')
y

Period('2016', 'A-DEC')

In [ ]:
# 'A-DEC' means A=Annual which is ending in December

In [3]:
 # to find all the properties
    
dir(y)

['__add__',
 '__array_priority__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__weakref__',
 '_add_offset',
 '_add_timedeltalike_scalar',
 '_dtype',
 '_from_ordinal',
 '_maybe_convert_freq',
 '_require_matching_freq',
 'asfreq',
 'day',
 'day_of_week',
 'day_of_year',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'end_time',
 'freq',
 'freqstr',
 'hour',
 'is_leap_year',
 'minute',
 'month',
 'now',
 'ordinal',
 'quarter',
 'qyear',
 'second',
 'start_time',
 'strftime',
 'to_timestamp',
 'week',
 'weekday',
 'weekofyear',
 'year']

In [4]:
# start time
y.start_time

Timestamp('2016-01-01 00:00:00')

In [5]:
# end time
y.end_time

Timestamp('2016-12-31 23:59:59.999999999')

# monthly time period frequency

In [6]:
# monthly time period
m=pd.Period('2011-1', freq='M')
m

Period('2011-01', 'M')

In [9]:
# start time
m.start_time

Timestamp('2011-01-01 00:00:00')

In [10]:
# end time
m.end_time

Timestamp('2011-01-31 23:59:59.999999999')

In [11]:
m+1

# it will add one month to january and gives february

Period('2011-02', 'M')

# daily time period frequency

In [13]:
d=pd.Period('2011-2-28', freq='D')
d

Period('2011-02-28', 'D')

In [14]:
# start time
d.start_time

Timestamp('2011-02-28 00:00:00')

In [15]:
# end time
d.end_time

Timestamp('2011-02-28 23:59:59.999999999')

In [16]:
d+1

#adding one day it'll give 1st march

Period('2011-03-01', 'D')

In [17]:
d1=pd.Period('2016-2-28', freq='D')
d1+1

##adding one day it'll give 29th february as 2016 is leap year

Period('2016-02-29', 'D')

# hourly time period frequency

In [18]:
h=pd.Period('2011-2-28', freq='H')
h

Period('2011-02-28 00:00', 'H')

In [19]:
# start time
h.start_time

Timestamp('2011-02-28 00:00:00')

In [20]:
# end time
h.end_time

Timestamp('2011-02-28 00:59:59.999999999')

In [21]:
h+1

Period('2011-02-28 01:00', 'H')

In [24]:
#adding hours using pandas offset
h+pd.offsets.Hour()

Period('2011-02-28 01:00', 'H')

In [25]:
h+pd.offsets.Hour(3)

Period('2011-02-28 03:00', 'H')

In [26]:
h

Period('2011-02-28 00:00', 'H')

In [27]:
h+pd.offsets.Hour(-1)

Period('2011-02-27 23:00', 'H')

# quarterly time period. in USA 4 quarterly time periods first in jan to mar, 2nd is april to june, 3rd is july to sep and 4th is oct to dec

In [28]:
q=pd.Period('2011-2-28', freq='Q')
q

Period('2011Q1', 'Q-DEC')

In [29]:
# start time
q.start_time

Timestamp('2011-01-01 00:00:00')

In [30]:
# end time
q.end_time

#first quarter ends in march 31

Timestamp('2011-03-31 23:59:59.999999999')

In [38]:
q2=pd.Period('2017Q4','Q-JAN')
q2.start_time
q2.end_time

Timestamp('2017-01-31 23:59:59.999999999')

In [32]:
# start time
q2.start_time

Timestamp('2016-02-01 00:00:00')

In [39]:
q.asfreq('M', how='start')

Period('2011-01', 'M')

In [40]:
q.asfreq('M', how='end')

Period('2011-03', 'M')

# period range()
# will print all of the quaterly times between 2011 to 2017.

In [3]:
idx=pd.period_range('2011','2017', freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4', '2016Q1',
             '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2', '2017Q3',
             '2017Q4'],
            dtype='period[Q-JAN]')

In [4]:
idx[0].start_time

Timestamp('2010-11-01 00:00:00')

In [5]:
idx[0].end_time

Timestamp('2011-01-31 23:59:59.999999999')

# to print 10 periods from 2011

In [6]:
idx=pd.period_range('2011', periods=10, freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1'],
            dtype='period[Q-JAN]')

In [7]:
idx=pd.period_range('2011', periods=100, freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4', '2016Q1',
             '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2', '2017Q3',
             '2017Q4', '2018Q1', '2018Q2', '2018Q3', '2018Q4', '2019Q1',
             '2019Q2', '2019Q3', '2019Q4', '2020Q1', '2020Q2', '2020Q3',
             '2020Q4', '2021Q1', '2021Q2', '2021Q3', '2021Q4', '2022Q1',
             '2022Q2', '2022Q3', '2022Q4', '2023Q1', '2023Q2', '2023Q3',
             '2023Q4', '2024Q1', '2024Q2', '2024Q3', '2024Q4', '2025Q1',
             '2025Q2', '2025Q3', '2025Q4', '2026Q1', '2026Q2', '2026Q3',
             '2026Q4', '2027Q1', '2027Q2', '2027Q3', '2027Q4', '2028Q1',
             '2028Q2', '2028Q3', '2028Q4', '2029Q1', '2029Q2', '2029Q3',
             '2029Q4', '2030Q1', '2030Q2', '2030Q3', '2030Q4', '2031Q1',
             '2031Q2', '2031Q3', '2031Q4', '2032Q1', '2032Q2', '2032Q3',
             '2032Q4', '2033Q1', '2033Q2', '2033Q3', '2033Q4', '2034Q1',
             '2034Q2', '2034Q3', '2034Q4', '2035Q1', '2035Q2', '2035Q3',
             '2035Q4', '2036Q1', '2036Q2', '2036Q3'],
            dtype='period[Q-JAN]')

In [17]:
idx=pd.period_range('2011', periods=10, freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1'],
            dtype='period[Q-JAN]')

# create a random periodic pandas series using numpy

In [18]:
import numpy as np
ps=pd.Series(np.random.randn(len(idx)),idx)
ps     #the last index value is 10.

2011Q4   -0.889742
2012Q1    2.551358
2012Q2    0.587192
2012Q3    2.866277
2012Q4   -0.471062
2013Q1   -0.904331
2013Q2    0.385027
2013Q3    0.909336
2013Q4    0.968197
2014Q1   -2.727291
Freq: Q-JAN, dtype: float64

In [19]:
ps.index

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1'],
            dtype='period[Q-JAN]')

In [20]:
#we can do partial retrieve .
# for 2011 only

ps['2011']

2011Q4   -0.889742
2012Q1    2.551358
2012Q2    0.587192
2012Q3    2.866277
2012Q4   -0.471062
Freq: Q-JAN, dtype: float64

# to convert period index into date_time index

In [21]:
pst=ps.to_timestamp()
pst

2010-11-01   -0.889742
2011-02-01    2.551358
2011-05-01    0.587192
2011-08-01    2.866277
2011-11-01   -0.471062
2012-02-01   -0.904331
2012-05-01    0.385027
2012-08-01    0.909336
2012-11-01    0.968197
2013-02-01   -2.727291
Freq: QS-NOV, dtype: float64

# to convert date_time index to period index

In [22]:
pst.to_period()

2010Q4   -0.889742
2011Q1    2.551358
2011Q2    0.587192
2011Q3    2.866277
2011Q4   -0.471062
2012Q1   -0.904331
2012Q2    0.385027
2012Q3    0.909336
2012Q4    0.968197
2013Q1   -2.727291
Freq: Q-DEC, dtype: float64

In [57]:
import pandas as pd
df=pd.read_csv("wmt.csv")
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [25]:
# to make Line Item column to index
# df.set_index('Line Item', inplace=True)
# df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [28]:
# to make 2017Q1 column to index
# df.set_index('2017Q1', inplace=True)
# df

       Line Item  2017Q2  2017Q3  2017Q4  2018Q1
2017Q1
115904   Revenue  120854  118179  130936  117542
86544   Expenses   89485   87484   97743   87688
29360     Profit   31369   30695   33193   29854

In [58]:
#getting back to Line Item index
df.set_index('Line Item', inplace=True)
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [59]:
#to create a table
df= df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [60]:
# to convert regular object type into period index type
df.index=pd.PeriodIndex(df.index, freq='Q-JAN')
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [54]:
# to create start date index and assign the date of each period

# df['start date']= df.index.map(lambda x: x.start_time)
# df

Line Item  Revenue  Expenses  Profit start date Start Date
2017Q1      115904     86544   29360 2016-02-01 2016-02-01
2017Q2      120854     89485   31369 2016-05-01 2016-05-01
2017Q3      118179     87484   30695 2016-08-01 2016-08-01
2017Q4      130936     97743   33193 2016-11-01 2016-11-01
2018Q1      117542     87688   29854 2017-02-01 2017-02-01

In [61]:
# to create start date index and assign the date of each period

df['start date']= df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit start date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [63]:
# to create End date index
df['end date']= df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit start date                      end date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999